In [1]:
#import libraries
import pandas as pd

In [3]:
#our messy sample dataset
data = {
    "EmpID": [101, 102, "103", 104, 105, 106, None, 108, 109, 110],
    "fullName": [
        " Alice Johnson ", "MICHEAL smith", "sarah lee", "David-Kim", None, "john brown", 
        "Emma Wilson", "TOM  davis", "Jane Miller", "Chris taylor"
    ],
    "Dept": ["IT", "hr", "Mktng", "IT", "finance", "marketing", "Finance", None, "HR", "marketing"],
    "Age": [29, "thirty-five", 26, 31, 42, 27, 33, 30, None, 28],
    "Salary($)": ["$5500.50", "4800", "4200.75", "NaN", "6100", "4,300", "5800", "5000", "4700.0", "4400"],
    "JoinDate": [
        "2021/04/12", "2020-11-01", "18-01-2022", "2019/9/25", "July 5, 2018", 
        "2021/10/14", "2019.12.01", "March 22 2020", "2021-05-10", "Feb-05-2022"
    ],
    "Performance": [87, "73", 90, 65, 82, 75, 88, None, "79%", "91"],
    "Remote?": ["Yes", "No", "Y", "N", "yes", "no", "Y", "Yes", None, "True"]
}

#create the dataframe
df = pd.DataFrame(data)

#display dataframe
df

,EmpID,fullName,Dept,Age,Salary($),JoinDate,Performance,Remote?
0,101,Alice Johnson,IT,29,$5500.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020-11-01,73,No
2,103,sarah lee,Mktng,26,4200.75,18-01-2022,90,Y
3,104,David-Kim,IT,31,NaN,2019/9/25,65,N
4,105,None,finance,42,6100,"July 5, 2018",82,yes
5,106,john brown,marketing,27,"4,300",2021/10/14,75,no
6,None,Emma Wilson,Finance,33,5800,2019.12.01,88,Y
7,108,TOM davis,None,30,5000,March 22 2020,None,Yes
8,109,Jane Miller,HR,None,4700.0,2021-05-10,79%,None
9,110,Chris taylor,marketing,28,4400,Feb-05-2022,91,True

In [4]:
#get the shapes of the data
df.shape

(10, 8)

In [5]:
#infomation of the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmpID        9 non-null      object
 1   fullName     9 non-null      object
 2   Dept         9 non-null      object
 3   Age          9 non-null      object
 4   Salary($)    10 non-null     object
 5   JoinDate     10 non-null     object
 6   Performance  9 non-null      object
 7   Remote?      9 non-null      object
dtypes: object(8)
memory usage: 768.0+ bytes

In [9]:
#get the first five rows of the dataset
df.head()

,EmpID,fullName,Dept,Age,Salary($),JoinDate,Performance,Remote?
0,101,Alice Johnson,IT,29,$5500.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020-11-01,73,No
2,103,sarah lee,Mktng,26,4200.75,18-01-2022,90,Y
3,104,David-Kim,IT,31,NaN,2019/9/25,65,N
4,105,None,finance,42,6100,"July 5, 2018",82,yes

In [10]:
#get the columns names
df.columns

Index(['EmpID', 'fullName', 'Dept', 'Age', 'Salary($)', 'JoinDate',
       'Performance', 'Remote?'],
      dtype='object')

In [12]:
df.isnull().sum()

EmpID          1
fullName       1
Dept           1
Age            1
Salary($)      0
JoinDate       0
Performance    1
Remote?        1
dtype: int64

In [14]:
#inspect the dataset
print(df["Dept"].unique())
print(df["Remote?"].unique())
print(df["Age"].unique())

['IT' 'hr' 'Mktng' 'finance' 'marketing' 'Finance' None 'HR']
['Yes' 'No' 'Y' 'N' 'yes' 'no' None 'True']
[29 'thirty-five' 26 31 42 27 33 30 None 28]

In [15]:
#inspect salary column
df["Salary($)"].head(10)

0    $5500.50
1        4800
2     4200.75
3         NaN
4        6100
5       4,300
6        5800
7        5000
8      4700.0
9        4400
Name: Salary($), dtype: object

In [16]:
#inspect for JoinDate column
df["JoinDate"].tolist()

['2021/04/12',
 '2020-11-01',
 '18-01-2022',
 '2019/9/25',
 'July 5, 2018',
 '2021/10/14',
 '2019.12.01',
 'March 22 2020',
 '2021-05-10',
 'Feb-05-2022']

In [19]:
#inspect for EmpID, fullName, and performance
df["Performance"].tolist()

[87, '73', 90, 65, 82, 75, 88, None, '79%', '91']

In [20]:
df["fullName"].tolist()

[' Alice Johnson ',
 'MICHEAL smith',
 'sarah lee',
 'David-Kim',
 None,
 'john brown',
 'Emma Wilson',
 'TOM  davis',
 'Jane Miller',
 'Chris taylor']

In [21]:
df["EmpID"].tolist()

[101, 102, '103', 104, 105, 106, None, 108, 109, 110]

In [24]:
#start cleaning the dataset
#rename columns heads
df.rename(columns={
    "EmpID": "emp_id",
    "fullName": "full_name",
    "Dept": "department",
    "Age": "age",
    "Salary($)": "salary",
    "JoinDate": "join_date",
    "Performance": "performance",
    "Remote?": "remote"
}, inplace=True)

df

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29,$5500.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020-11-01,73,No
2,103,sarah lee,Mktng,26,4200.75,18-01-2022,90,Y
3,104,David-Kim,IT,31,NaN,2019/9/25,65,N
4,105,None,finance,42,6100,"July 5, 2018",82,yes
5,106,john brown,marketing,27,"4,300",2021/10/14,75,no
6,None,Emma Wilson,Finance,33,5800,2019.12.01,88,Y
7,108,TOM davis,None,30,5000,March 22 2020,None,Yes
8,109,Jane Miller,HR,None,4700.0,2021-05-10,79%,None
9,110,Chris taylor,marketing,28,4400,Feb-05-2022,91,True

In [25]:
#cleaning inconsistent values on fullname
df["full_name"] = df["full_name"].str.strip()
df["full_name"] = df["full_name"].str.title()
df["full_name"] = df["full_name"].str.replace(r"\s+", " ", regex=True)
df["full_name"] = df["full_name"].str.replace("-", " ")

df["full_name"]

0    Alice Johnson
1    Micheal Smith
2        Sarah Lee
3        David Kim
4             None
5       John Brown
6      Emma Wilson
7        Tom Davis
8      Jane Miller
9     Chris Taylor
Name: full_name, dtype: object